In [7]:
import pandas as pd
from warnings import filterwarnings 
from sqlalchemy import create_engine
from arch import arch_model
from assets.GARCHModel import GarchModel
from assets.PostgresManager import PostgresModel
from assets.LSTMModeller import LSTMModeller
from assets.QueryManager import QueryModel
from assets.Statics import Stock_Stats
filterwarnings("ignore")

In [8]:
dbmodel = PostgresModel()
test = QueryModel()

In [9]:
aa = Stock_Stats(schema='bistall', table_name='HALKB')
aa.price_return
(aa.series[-1] - aa.series[-2]) / aa.series[-2]

np.float64(0.003086372512705649)

In [12]:


for schema in test.sub_tables_dict.keys():
    created_schema_name = "stats" + schema
    dbmodel.create_schema(created_schema_name)
    for table in test.sub_tables_dict[schema]:
        try:
            STATS = Stock_Stats(schema=schema, table_name=table)
            values = [STATS.table_name, STATS.last_price , STATS.former_price ,STATS.mean_pct,STATS.std_pct, STATS.price_return, STATS.data_max_date]
            columns = ["table_name","last_price" ,"former_price" , "mean", "std", "return", "data_max_date"]
            df = pd.DataFrame([values], columns=columns)
            #df.to_sql(table, con=dbmodel.engine, schema=created_schema_name, if_exists="append", index=False)
            display(df)
        except Exception as e:
            print(e)

,table_name,last_price,former_price,mean,std,return,data_max_date
0,EURTRY=X,36.711498,36.591099,0.000639,0.010765,0.00329,2024-12-01

,table_name,last_price,former_price,mean,std,return,data_max_date
0,USDTRY=X,34.702999,34.648369,0.000682,0.010449,0.001577,2024-12-01

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KERVN,2.1,2.12,0.001451,0.056819,-0.009434,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KERVT,14.88,14.3,0.001419,0.040616,0.040559,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KFEIN,84.599998,85.400002,0.002306,0.035296,-0.009368,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KGYO,5.43,5.43,0.001055,0.049989,0.0,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KIMMR,10.03,10.28,0.001872,0.036888,-0.024319,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLGYO,4.64,4.66,0.001004,0.033607,-0.004292,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLKIM,29.0,29.26,0.002887,0.033262,-0.008886,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLMSN,26.280001,25.799999,0.00107,0.032692,0.018605,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLNMA,15.05,15.4,0.001014,0.038666,-0.022727,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLRHO,29.639999,29.1,0.004654,0.041488,0.018557,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLSER,33.860001,33.599998,0.001461,0.041019,0.007738,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KLSYN,5.36,5.36,0.002328,0.032968,0.0,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KMPUR,18.799999,19.200001,0.002266,0.034981,-0.020833,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KNFRT,10.64,10.83,0.001499,0.035815,-0.017544,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KOCMT,15.88,15.73,-0.002129,0.030825,0.009536,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KONKA,40.099998,39.5,0.003017,0.039306,0.01519,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KONTR,48.02,47.98,0.00555,0.043611,0.000834,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KONYA,7042.5,7005.0,0.001365,0.033462,0.005353,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KOPOL,33.380001,32.84,0.001194,0.036693,0.016443,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KORDS,71.75,71.949997,0.000841,0.025886,-0.00278,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KOTON,19.870001,19.34,-0.003335,0.028037,0.027404,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KOZAA,70.449997,68.5,0.00154,0.03513,0.028467,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KOZAL,22.719999,21.540001,0.001454,0.030017,0.054782,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRDMA,27.299999,27.18,0.001479,0.035022,0.004415,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRDMB,22.1,21.700001,0.001455,0.035316,0.018433,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRDMD,27.440001,26.98,0.001477,0.033678,0.01705,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRGYO,40.580002,36.900002,0.001839,0.034606,0.099729,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRONT,23.280001,23.799999,0.001814,0.034388,-0.021849,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRPLS,7.27,7.4,0.001089,0.031252,-0.017568,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRSTL,5.8,5.79,0.00067,0.038269,0.001727,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRTEK,28.48,28.700001,0.001031,0.03597,-0.007666,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KRVGD,2.26,2.22,0.001216,0.029305,0.018018,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KSTUR,3040.0,2815.0,0.004947,0.053097,0.079929,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KTLEV,60.650002,58.700001,0.005275,0.051457,0.03322,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KTSKR,63.200001,63.349998,0.0022,0.03845,-0.002368,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KUTPO,76.800003,75.0,0.001321,0.032731,0.024,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KUVVA,56.0,55.0,0.001267,0.038993,0.018182,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KUYAS,17.200001,17.01,0.001752,0.037552,0.01117,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KZBGY,30.200001,29.719999,0.00176,0.038926,0.016151,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,KZGYO,23.68,23.559999,0.000803,0.037147,0.005093,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LIDER,126.5,123.800003,0.004823,0.036194,0.021809,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LIDFA,2.99,2.97,0.001895,0.034055,0.006734,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LILAK,27.719999,27.18,-0.002309,0.029148,0.019868,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LINK,516.0,520.0,0.001745,0.039408,-0.007692,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LKMNH,16.950001,17.0,0.001771,0.028835,-0.002941,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LMKDC,26.16,25.700001,0.002745,0.038356,0.017899,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LOGO,113.5,114.0,0.00135,0.032925,-0.004386,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LRSHO,2.38,2.37,-0.000504,0.041878,0.00422,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LUKSK,95.5,90.75,0.001339,0.039739,0.052342,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LYDHO,118.0,117.0,-0.001459,0.249207,0.008547,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,LYDYE,9827.5,9800.0,-0.002645,0.043859,0.002806,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MAALT,834.0,828.5,0.001497,0.035656,0.006639,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MACKO,105.099998,99.75,0.002941,0.035875,0.053634,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MAGEN,19.049999,19.0,0.003375,0.035991,0.002632,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MAKIM,24.200001,24.18,0.003367,0.03854,0.000827,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MAKTK,6.24,6.07,0.000963,0.039024,0.028007,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MANAS,9.12,8.86,0.002393,0.04129,0.029345,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MARBL,12.78,12.71,0.000944,0.038047,0.005507,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MARKA,54.5,54.0,0.001752,0.042508,0.009259,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MARTI,3.2,3.21,0.000868,0.035842,-0.003115,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MAVI,82.75,80.25,0.001821,0.025951,0.031153,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MEDTR,52.799999,51.950001,0.00277,0.031774,0.016362,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MEGAP,3.3,3.1,0.001664,0.040873,0.064516,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MEGMT,31.040001,31.0,0.000988,0.045047,0.00129,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MEKAG,42.34,42.619999,0.002509,0.044367,-0.00657,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MEPET,9.39,9.46,0.000964,0.038036,-0.0074,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MERCN,12.96,13.0,0.002159,0.033548,-0.003077,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MERIT,192.0,199.100006,0.003088,0.050693,-0.035661,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MERKO,15.05,15.36,0.001035,0.037851,-0.020182,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,METRO,2.67,2.55,0.0016,0.084269,0.047059,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,METUR,15.2,15.1,0.001276,0.037249,0.006622,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MGROS,483.25,479.5,0.001181,0.048287,0.007821,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MHRGY,5.12,5.2,0.000695,0.02868,-0.015385,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MIATK,44.080002,43.34,0.005662,0.04595,0.017074,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MMCAS,19.25,20.0,0.001857,0.049075,-0.0375,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MNDRS,10.85,10.99,0.001066,0.036446,-0.012739,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MNDTR,5.65,5.61,0.000677,0.035014,0.00713,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MOBTL,4.17,4.12,0.001762,0.03331,0.012136,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MOGAN,10.02,9.97,0.000031,0.037884,0.005015,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MPARK,400.0,386.75,0.00219,0.028582,0.03426,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MRGYO,5.06,4.75,0.001054,0.035425,0.065263,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MRSHL,1643.0,1640.0,0.001138,0.035315,0.001829,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MSGYO,14.47,14.66,0.001728,0.03328,-0.01296,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MTRKS,19.0,19.290001,0.001962,0.035809,-0.015034,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MTRYO,6.83,6.79,0.000895,0.031774,0.005891,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,MZHLD,6.96,7.1,0.001473,0.04089,-0.019718,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NATEN,49.200001,49.240002,0.00401,0.041832,-0.000812,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NETAS,72.900002,72.75,0.000938,0.032629,0.002062,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NIBAS,18.6,18.639999,0.001522,0.04176,-0.002146,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NTGAZ,5.94,6.0,0.00235,0.035587,-0.01,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NTHOL,45.700001,45.900002,0.001042,0.034883,-0.004357,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NUGYO,7.95,7.9,0.000915,0.035057,0.006329,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,NUHCM,319.5,315.0,0.001108,0.029163,0.014286,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OBAMS,43.360001,42.119999,0.000773,0.026388,0.02944,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OBASE,31.6,30.879999,0.002488,0.039217,0.023316,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ODAS,6.15,6.17,0.001245,0.031467,-0.003241,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ODINE,110.800003,117.800003,0.008397,0.050239,-0.059423,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OFSYM,40.240002,40.34,0.00172,0.039944,-0.002479,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ONCSM,99.199997,100.699997,0.004909,0.054014,-0.014896,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ONRYT,76.599998,76.099998,0.003752,0.046414,0.00657,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ORCAY,9.26,9.16,0.001271,0.037383,0.010917,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ORGE,87.25,87.699997,0.00221,0.0344,-0.005131,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,ORMA,204.0,200.199997,0.001526,0.053872,0.018981,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OSMEN,9.23,9.12,0.002059,0.045426,0.012061,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OSTIM,8.3,8.35,0.001105,0.036735,-0.005988,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OTKAR,474.25,485.0,0.001291,0.030139,-0.022165,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OTTO,600.0,561.0,0.002693,0.0442,0.069519,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OYAKC,72.400002,70.050003,0.000817,0.031532,0.033547,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OYAYO,26.16,25.9,0.001297,0.032897,0.010039,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OYLUM,8.24,8.21,0.001378,0.036643,0.003654,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OYYAT,34.799999,34.82,0.002349,0.028046,-0.000574,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZATD,87.349998,85.650002,-0.003285,0.050749,0.019848,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZGYO,5.62,5.48,0.001842,0.048832,0.025547,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZKGY,12.86,12.51,0.00159,0.02832,0.027978,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZRDN,8.69,8.7,0.001744,0.035638,-0.001149,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZSUB,32.259998,31.66,0.003593,0.042383,0.018951,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,OZYSR,26.299999,26.18,-0.000582,0.03667,0.004584,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PAGYO,65.050003,64.949997,0.001446,0.021349,0.00154,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PAMEL,91.699997,91.349998,0.002249,0.041597,0.003831,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PAPIL,13.08,12.87,0.00266,0.038823,0.016317,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PARSN,87.75,87.849998,0.001377,0.031653,-0.001138,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PASEU,25.799999,25.76,0.004405,0.040185,0.001553,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PATEK,93.099998,91.550003,0.005892,0.053392,0.016931,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PCILT,17.389999,17.129999,0.002974,0.042196,0.015178,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PEHOL,1.68,1.68,0.00174,0.085675,0.0,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PEKGY,4.49,4.31,0.00196,0.038523,0.041763,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PENGD,6.84,6.6,0.000968,0.034505,0.036364,2024-11-29

,table_name,last_price,former_price,mean,std,return,data_max_date
0,PENTA,14.99,14.77,0.002462,0.041078,0.014895,2024-11-29

KeyboardInterrupt: